import Paper from "@/components/Assets/Paper";
import React from "react";

export default function ClubDescription() {
  return (
    <Paper className="p-4 lg:p-10">
      <article className="text-hgray-600 dark:text-text-dark-2 leading-9 [&>h2]:text-lg [&>h2]:text-mdark-500 dark:[&>h2]:text-text-dark-5 [&>h2]:font-semibold [&>h2]:my-3 [&>p]:mb-5 ">
        <h2>داستان مهدیار شو</h2>
        <p>
          تو جامعه خیلی می‌بینیم که نوجوون ها و جوون ها حتی بعضا بزرگسال ها در
          مورد اصول اولیه باید و نباید های زندگی اطلاعات کافی ندارن این موضوع
          یکی از دغدغه های ما بوده با صحبت ها و جلسه های متعدد به این نتیجه
          رسیدیم دوره ای رو تشکیل بدیم که احکام پایه رو یاد بدیم ،اصول اعتقادات
          رو مرور کنیم و مباحث رشدفردی و موفقیت که نیاز هست رو آموزش بدیم پس دست
          به کار شدیم و با اساتید مشورت کردیم و با لطف خدا و عنایت امام زمان
          دوره مهدیارشو وارد این دنیا شد برای اینکه همه ی ما مهدیار باشیم و
          مهدیار بمانیم
        </p>
        <p>تو این دوره ما باهم یک سفر سه ماهه رو میگذرونیم.</p>
        <p>
          بخش جذاب ماجرای سفرمون پشتیبانی هست و تیم پشتیبانی همسفرایی که تو این
          سه ماه کنار شمان، چند باری باهاتون تماس میگیرن و بهتون انگیزه میدن و
          اگر تو سفر سه ماه مون به مشکلی برخوردی کمکت میکنن.
        </p>
        <p>خلاصه رفیق جان </p>

        <p>
          بهت قول میدم تو این سفر سه ماهه خیلی بهمون خوش بگذره اگر توهم دوست
          داری با ما و تیم همسفر بشی ثبت نام یادت نره مهدیار باشیم و مهدیار
          بمانیم
        </p>
      </article>
    </Paper>
  );
}
